Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E11A.tmx
Source language: en_us
Languages: zh_cn

source: DIY: Reclaiming Your Wood to New Definitions
zh_cn: 旧木头新用途

source: Every day we are creating history.
zh_cn: 我们每一天都在创造历史。

source: What we do today may make it in the books next year.
zh_cn: 我们今天做的事，可能就是明年书上印的字。

source: We set trends, we invent new technology, and we make strides each second towards a bright new future.
zh_cn: 我们造势，发明新技术，我们每一秒都在大步流星地走向崭新的光明未来。

source: And while we are courageously shaping the future it is the past that has formed and made us to be whom and what we are today.
zh_cn: 我们勇敢地创造明天，而今天的我们由昨日而来。

source: It's opened doors to endless opportunities so we have a choice to repeat history or carve new futures.
zh_cn: 通往无限机遇的大门敞开了，我们可以选择重复历史，也可以雕琢新的明天。

source: And if we are creating history as we live in our modern homes watching futuristic films on our mind boggling gesture controlled TV's we can stay grounded with a piece of the past.
zh_cn: 如果我们仅在现代装潢的房子里看着描述未来的电影，惊叹于电视里演的，那么我们会永远被束缚在一小片过去里。

source: Taking something that by looks has no value, no appeal and peeling back the layers to find a real gem we can keep history alive and continue a saga with a new contemporary cover.
zh_cn: 翻出某个看似无用又平庸的东西，为它剔去外壳让它发光，让历史保持鲜活，为它披上现代的外衣继续它的传奇。

source: An amazing and breathtaking way to commemorate history is reclamation of wood.
zh_cn: 重新利用木头就是一个令人惊异称叹的纪念历史的方式。

source: Claiming a stake of the old and refurbishing it to your tastes and usability.
zh_cn: 取来一根旧木块，将它重新打造成符合你品味又实用的东西。

source: So prepare your palms for some splinters guys and gals - we're reclaiming wood.
zh_cn: 所以，你尽管摩拳擦掌，等着做出些好玩的小玩意儿吧......我们在改造旧木

source: Step One: Acquisition
zh_cn: 步骤一：搜罗

source: Finding wood that can go another round in life and be lived upon by a new generation can be tricky depending where you live.
zh_cn: 要找到一块能重新赋予之生命的可塑之材很难讨巧，因为这和你的居住地有关。

source: One of the best and common venues that have some of the most organic materials is an old barn.
zh_cn: 大多数有机材料最理想、最常见的地方是农场里的旧仓房。

source: In pursuit of new agriculture advances barns made out of wood don't fit that equation.
zh_cn: 但在新先进农业仓房里很少见符合这种标准的木头。

source: So post an ad on a local or national searchable classifieds letting the seller know there is a buyer interested in lumber.
zh_cn: 所以不妨发一个当地的或全国的分类广告，好让卖家知道有买家对他的木材感兴趣。

source: Remodelers are also another source for high quality virgin timber.
zh_cn: 你也可以去从事改造工作的师傅那里寻找高质原木。

source: Remodeling is like a form of recycling: You take a preexisting format and give it a dressy makeover, often using materials that are green based.
zh_cn: 重新塑造一个东西和回收利用异曲同工：你把东西改头换面一下，让它更漂亮，而使用的材料通常也是环保的。

source: So it's remodelers that have connections to dilapidated structures.
zh_cn: 所以这些师傅们会有废旧物的。

source: Start collecting business cards!
zh_cn: 那么开始搜集名片吧！

source: Step Two: As Is
zh_cn: 步骤二：保持原样

source: This isn't a Lumber liquidator.
zh_cn: 这不是木材清盘。

source: Your wood isn't going to be even formed slabs that are sanded and treated to perfection.
zh_cn: 你的木材甚至不会用磨砂制成光滑的平板。

source: They'll still carry the bruises and scars of their origins and may even bear the tragic knife wound letterings of Zak loves Chloe, and I Was Here.
zh_cn: 他们将带着原有的伤疤和擦伤，或还带着“扎克爱克洛伊”、“到此一游”这种悲剧刻痕。

source: They are sold or taken as is. Nails, screws, splints and other forms of all-clinging tentacles are part of your new reclaimable beam.
zh_cn: 他们被买来或拿来是就是那样，板钉、螺丝钉、甲板和所有其他形式的触毛都会是你在回收中微笑的一部分。

source: Carefully pull out every nail.
zh_cn: 小心地取出每一个板钉。

source: They may be rusty, bent and stubbornly clinging to their mate so you want to make sure you are withdrawing the entire nail.
zh_cn: 它们可能扭曲地牢牢锈在了一起，所以你要确定一整个拔出。

source: If you are unable to do this you can perform a surgical procedure with your Dremmel tool to angle off the opposing sharp nail.
zh_cn: 如果你做不到，可以用德雷梅尔工具实施一个手术步骤从偏角取出尖利碍事的板钉。

source: Oh, and you might want to be up to date on your tetanus shot!
zh_cn: 呃，你可能想去补最新的破伤风针了。

source: Step Three: Aesthetics
zh_cn: 步骤三：审美

source: At this point you are ready to cut it down to your desired size.
zh_cn: 在这个步骤里，你要准备把木材锯成理想大小。

source: Countertop, coffee table, bench, shelving, you can slice it down to slots that can be glued together with high performance wood glue.
zh_cn: 工作台面、咖啡桌、长椅、柜子都可以锯成插槽，然后用性能好的木胶胶起来。

source: But first you need to cleanse and sand.
zh_cn: 当然，你首先得清洁它，然后用磨砂纸打磨好。

source: The past years have not been kind to the wood.
zh_cn: 岁月催“木”老。

source: Like a sponge it has harbored a lifetime of collections that need to be disposed of so that the coming years can get it's own wear and tear worked in its refined surface.
zh_cn: 就像一块海绵，我们必须将其前身所有的积攒抛弃，才能让后来的岁月在它精致的表面留下斑斑足印。

source: Your planed down remnants should still have the charm and character of it pre-reclaimed state but post-claim will look stunning and is almost ready to be accepted in your home.
zh_cn: 你刨来的这些余料可能还带有木头被改造前的魅力和特点，但改造后看着它就觉得精妙无双，迫不及待地把它摆在家里。

source: Step Four: Abracadabra­It's Reclaimed
zh_cn: 步骤四：嘛利嘛利哞......

source: There are few if any occasions in life where a stain is a good thing.
zh_cn: 大功告成在生活中，在大多数情况下瑕疵都不是好事。

source: How many hours have we spent hunched over on our knees, nose to the ground intently watching to see if the Nutella/Red Wine combo stain has shrunk in diameter or tone yet?
zh_cn: 我们曾浪费多少小时跪着弓腰弯背，把鼻子凑到地上看红果酱和红酒的混合污点是否小了点或淡了点。

source: Our reclaimed wood, however would bathe in stain if we permitted.
zh_cn: 但如果可以，改造后的木头可以斑斑驳驳。

source: Using a basic paintbrush give your ancient baby a warm coat of stain followed by a second coat if needed. Watch as it transforms from a barn door into a intricate slab of lumber with one of a kind knots that can't be found elsewhere.
zh_cn: 有需要的话，你可以给你的这个年迈的婴孩刷上一层新衣，盖住瑕疵，看起来就像是把一个仓门改造成了带着独一无二木结的诡异木板。

source: You know have a right to question who said history was boring?
zh_cn: 你有权利反问是谁说历史枯燥无味？

source: Who said there was no application to present day?
zh_cn: 谁说现在缺少可关心的东西？

source: Who said the wood that made your new furniture piece was worthless?
zh_cn: 谁说木制家具毫无价值？

source: Reclaimed wood proves right on so many accounts.
zh_cn: 改造木头可一举列出多个益处。

source: Cheers to the next ten years of your wood.
zh_cn: 为伴你下个十年的木头欢呼吧。

source: May you and it have a wonderful long-lived existence together!
zh_cn: 希望它与你长久共度美好生活！
